1.	Create a program that asks the user to enter their name and their age. Print out a message that tells them the year that they will turn 100 years old

In [3]:
a = input("enter your name")
b = int(input("enter your age"))
print(a,"will turn 100 in",100-b,"years")

enter your name sri
enter your age 20
 sri will turn 100 in 80 years

2.	What is pandas groupby? Demonstrate with your own example

In [5]:
import pandas as pd
import numpy as np

In [13]:
x = {"name":["si","vijay","vinay"],"age":[20,23,25],"school":["kpcv","vellamal","bhavans"]}
df = pd.DataFrame(x)
df

    name  age    school
0     si   20      kpcv
1  vijay   23  vellamal
2  vinay   25   bhavans

In [28]:
df.groupby(["age"])["name"].sum() 
## With the help pandas groupby function we can intrepret indvidually with respect to a single column or perform operations individually with another column

age
20       si
23    vijay
25    vinay
Name: name, dtype: object

3.	How to create a dataframe from list?

In [45]:
b = list(range(0,10,2))
df2 = pd.DataFrame(b)
df2

   0
0  0
1  2
2  4
3  6
4  8

4.	What are the ways to combine the dataframe in pandas. Give an example for each

In [47]:
dict3={'Age':[25,26,25,23,30,29,23],
       'Name':['Tom','James','Ricky','Vin','Steve','Smith','Jack'],
      'Rating':[4.23,3.24,3.98,2.56,3.20,4.60,3.80]}
df3 = pd.DataFrame(dict3)
df3

   Age   Name  Rating
0   25    Tom    4.23
1   26  James    3.24
2   25  Ricky    3.98
3   23    Vin    2.56
4   30  Steve    3.20
5   29  Smith    4.60
6   23   Jack    3.80

In [55]:
s_left = df3.loc[:3]
s_left

   Age   Name  Rating
0   25    Tom    4.23
1   26  James    3.24
2   25  Ricky    3.98
3   23    Vin    2.56

In [57]:
s_right = df3.loc[4:]
s_right

   Age   Name  Rating
4   30  Steve     3.2
5   29  Smith     4.6
6   23   Jack     3.8

In [67]:
s= pd.merge(s_left,s_right,on="Age")  #merge-function
s

   Age Name_x  Rating_x Name_y  Rating_y
0   23    Vin      2.56   Jack       3.8

In [74]:
pd.concat([s_left,s_right],0)    #concatfunction

C:\Users\Srivatsa\AppData\Local\Temp/ipykernel_9364/1947786236.py:1: FutureWarning: In a future version of pandas all arguments of concat except for the argument 'objs' will be keyword-only
  pd.concat([s_left,s_right],0)    #concatfunction

   Age   Name  Rating
0   25    Tom    4.23
1   26  James    3.24
2   25  Ricky    3.98
3   23    Vin    2.56
4   30  Steve    3.20
5   29  Smith    4.60
6   23   Jack    3.80

5.	What is the difference between list and tuples in Python

In [78]:
a = [1,2,3,4,5]
b = (1,2,3,4,5)

## List mutable while tupe is immutable

In [76]:
a[1] = 3
a

[1, 3, 3, 4, 5]

In [77]:
b[1] = 3
b

TypeError: 'tuple' object does not support item assignment

## 6.	Find out the mean, median and standard deviation of this numpy array -> np.array([1,5,3,100,4,48])

In [80]:
r =np.array([1,5,3,100,4,48])
r

array([  1,   5,   3, 100,   4,  48])

In [85]:
r.mean()

26.833333333333332

In [87]:
np.median(a)

3.0

In [89]:
np.std(a)

1.4142135623730951

7.	How will you remove duplicate elements from a list?

In [99]:
list1 = [1,1,2,3,4]   ## set is a function used to remove duplicate values.
dup = set(list1)
print(dup)

{1, 2, 3, 4}

8.	What is a map() function in Python? Give an example

In [108]:
x = [2,4,6,8]
y = list(map(lambda x: x*x, x))
print(y)

[4, 16, 36, 64]

## 9.	What is pass in Python?

Pass function is used run a loop which is incomplete or for which we can develop the code in future

In [117]:
for i in range(10):
    print(i)
    if i == 5:
        pass

0
1
2
3
4
5
6
7
8
9

## 10.	What is vstack() in numpy? Give an example

Vstack function is used to combine two arrays vertically

In [126]:
a = [1,2,3]
b = [3,4,5]
np.vstack((a,b))

array([[1, 2, 3],
       [3, 4, 5]])